app/views/groups/_form.html.haml

          %input{name: "group[user_ids][]", type: "hidden", value: current_user.id}
        - group.users.each do |user|
---
SELECT `users`.`id` FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1