app/controllers/groups_controller.rb

INSERT INTO `group_users` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 2, '2020-06-11 06:25:59.080939', '2020-06-11 06:25:59.080939')
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('a', '2020-06-11 06:25:59.074825', '2020-06-11 06:25:59.074825')
---
    def new
        @group = Group.new
        @group.users << current_user

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
    def edit
        @group = Group.find(params[:id])

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `groups`.`name` = 'daa', `groups`.`updated_at` = '2020-06-11 09:49:44.040485' WHERE `groups`.`id` = 1
---
    def update
      @group = Group.find(params[:id])
      if @group.update(group_params)